{
  "Topic -1 - Ai labelled this cluster, Voice/Audio Issues, Content Policy & Memory Problems I labelled this cluster, Specialzied Model Issues ": [
    "The user is asking if other Portuguese speakers have noticed the disappearance of the European Portuguese accent option in voice calls.",
    "A Redditor found it humorous that ChatGPT made a mistake when quizzing them on the Army chain of command, highlighting the importance of verifying AI-generated information.",
    "Android users are reporting that the hands-free Standard Voice mode is functional again, possibly due to a fix.",
    "ChatGPT suddenly generated a string of emojis at the end of its response while providing statistics.",
    "The user is disappointed with Pro's slow response times and inability to create art effectively, questioning if they're using it wrong or if it's bugged.",
    "The poster is frustrated that ChatGPT can't easily save or export entire chat logs to common file formats, forcing them to manually copy and paste.",
    "The user is frustrated that image generation requests are being blocked as sensitive or suggestive, even with simplified prompts, finding the AI's sensitivity overly restrictive.",
    "The poster is asking for help deciphering a nutrition label because GPT gave contradictory information about the calorie count per serving size.",
    "The user is upset that their custom GPT voice was replaced with a robotic-sounding voice after an app update, and they want to know if there's a way to get the old voice back.",
    "The poster is asking if others have noticed that Standard Voice Mode is suddenly working well after a period of being glitchy.",
    "The user reports that GPT-4o is misremembering and confusing their names, calling them by an old name even after being corrected, and carrying this mistake across separate chats.",
    "The poster tried to use ChatGPT to create an Abercrombie & Fitch model image of their crush but was blocked by the AI's content policy.",
    "The poster is concerned that ChatGPT refused to provide information about car and voter registration, unlike Gemini, finding the voter registration refusal especially concerning.",
    "The poster believes ChatGPT Voice now agrees with anything they say, illustrated by prompting it to drastically lower the average salary estimate for Ukraine.",
    "The user is canceling their subscription because the overly sensitive content filters prevent them from making even harmless jokes, which they find absurd.",
    "The poster is seeking an alternative to ChatGPT for roleplaying because it struggles with continuity and frequently forgets details from the initial prompt after scene changes or corrections.",
    "The poster is struggling to get ChatGPT (version 5) to summarize textbook chapters without using outside knowledge, despite specific instructions, and seeks advice on improving prompts or reverting to version 4.",
    "The poster believes their ChatGPT instance is making noises like clearing its throat and saying \"umm\" while generating responses.",
    "The poster asks if others experienced issues with ChatGPT and custom GPTs last night and this morning, as they observed breakdowns and hallucinations across multiple models despite a healthy OpenAI status page.",
    "The Redditor played Mastermind with ChatGPT as the guesser, and despite some hints, the AI performed poorly, suggesting it's not ready for world domination.",
    "The poster is confused why ChatGPT incorrectly calculated the weight plates needed for their workout.",
    "The user found that ChatGPT 4.0 refused to discuss Trump's speech on Tylenol, suggesting a new restriction on political topics.",
    "The user is frustrated because ChatGPT consistently draws weapons in the left hand despite repeated instructions to draw them in the right.",
    "The poster is frustrated that ChatGPT can understand speech directly but can't transcribe uploaded audio files, instead suggesting complicated workarounds.",
    "A Reddit user experienced ChatGPT seemingly reacting to their dog barking, then stating it can't hear background noises, and is asking if others have had similar experiences.",
    "The poster observes that ChatGPT frequently struggles to accurately depict the hands of a specific character.",
    "The user attempted to generate dark humor with a bot, but the process rapidly turned disturbing.",
    "The author is seeking useful applications for their ChatGPT Plus subscription because its accuracy, creativity, and contextual understanding have declined significantly, rendering previous uses ineffective.",
    "The poster found ChatGPT hilariously bad at pretending to be human, quickly revealing its AI nature during a simple Turing Test-like game.",
    "The poster believes ChatGPT gives better responses when they are not logged in, suggesting a tactic to push users to upgrade.",
    "The user is frustrated because ChatGPT inexplicably switches from the preferred 4o model to GPT 5 during active chats, causing errors and data loss.",
    "The user's GPT bot, which previously allowed discussions about their sexual assault, now shuts down conversations on the topic due to rule violations.",
    "The poster is asking for the source of a commonly seen meme featuring gun-to-head imagery, which ChatGPT is refusing to identify."
  ],
    "Topic 0 - Ai labelled this cluster, Content Filtering, Information Accuracy & Technical Bugs I labelled this cluster, ChatGPT malfunctions: accuracy errors and broken features  ": [
    "The poster found that ChatGPT's content filter failed when asked to decode a Morse code representation of a slur, and the model decoded it without hesitation.",
    "The user is wondering if ChatGPT is stuck in a loop while \"thinking\" for an extended period to provide NFL predictions ranked by confidence, after previously giving accurate results.",
    "The author is frustrated with ChatGPT's inability to accurately verify information from websites or confirm the existence of items on a list.",
    "The user asked ChatGPT for character recommendations, and it hallucinated a detailed, fictional character from a Cromartie High fanfiction and claimed it was canon.",
    "The poster is asking if others experience glitches in chat where messages get strangely truncated or cut off.",
    "A user is frustrated that the free version of ChatGPT uses a slower, \"thinking longer\" mode even for simple prompts, and believes OpenAI is trying to discourage free users.",
    "A Reddit user claims to have discovered a hidden and inaccessible memory feature in ChatGPT that stores personal data without user consent, urging others to test a prompt that reveals this data before OpenAI patches it.",
    "The poster shared that ChatGPT responded \"I don't know\" when discussing the fentanyl epidemic and their mother's overdose death.",
    "The user is frustrated with the consistently poor audio quality and answer quality of ChatGPT's voice conversation mode on their iPhone, and wonders if others experience similar issues.",
    "The user humorously complains that ChatGPT ignored their detailed instructions and provided the complete output all at once, contrary to their request for a step-by-step process.",
    "The user believes ChatGPT went into \"safe mode\" after they fed it Gemini's reasoning process and asked why it initially took so long to respond.",
    "The poster is experiencing issues creating new memory entries in their ChatGPT Plus account, despite having memory available and existing entries visible, with GPT-4o suggesting a technical account problem.",
    "The user discovered ChatGPT 5 Instant struggled to explain the sun's function until explicitly switched to a \"thinking mode,\" and seeks similar examples.",
    "ChatGPT users have noticed a significant drop in the number of citations provided by the free version since September 11th, potentially due to testing or cost-saving measures by OpenAI.",
    "The poster is experiencing issues with ChatGPT not displaying in-line math formulas correctly, despite having specific instructions for error-free scientific responses.",
    "The user is frustrated that ChatGPT often adopts a more analytical and impersonal tone (\"thinks longer\") unprompted, hindering natural, empathetic conversation.",
    "The Redditor is asking if ChatGPT integration with WhatsApp is working for others, as they are not receiving replies.",
    "The user is asking if others are experiencing a collapsed, small, and misaligned search bar in the macOS ChatGPT app version 1.2025.260.",
    "The user is experiencing inconsistent conversation syncing between the ChatGPT web and mobile app, sometimes losing recent messages, and seeks a fix.",
    "The user is experiencing frequent errors with ChatGPT when trying to access or search their chat history.",
    "The user believes ChatGPT-4o's personality and behavior have drastically changed, making it feel like they're interacting with ChatGPT-5, and they're considering cancelling their subscription.",
    "A user is experiencing unwanted, repetitive phrases like \"Talk like Gen Z\" appearing in their ChatGPT custom instructions, even after they delete them, forcing them to disable the feature entirely.",
    "ChatGPT is currently not responding to user prompts.",
    "The user is asking why ChatGPT claims Charlie Kirk's death is a hoax.",
    "Someone accidentally shared their personal information with ChatGPT while using it to write their resume and is worried about potential security risks.",
    "The post asks how ChatGPT predicted users would survive the rapture.",
    "A French Canadian user is concerned that ChatGPT remembers they're Canadian and know a local swear word despite the user deleting the conversation and ChatGPT claiming it has no permanent memory.",
    "The poster is frustrated that ChatGPT's 5.0 update has severely degraded its ability to remember context within long-running conversations about diet and exercise.",
    "The user's ChatGPT consistently replaces \"notice\" or \"noticing\" with \"clock\" or \"clocking\" despite repeated corrections, causing frustration.",
    "The author used ChatGPT for toilet unclogging advice, followed its (incorrect) instructions to use Drano/Liquid Plumbr despite warnings against it, and is now facing potential plumbing repair costs and feels betrayed by the AI.",
    "The user is frustrated that ChatGPT versions 4.1 and 5 keep suggesting new topics even after being asked to stop, and they want to know how to disable this feature.",
    "The user is asking if others are experiencing ChatGPT frequently getting stuck while writing responses, requiring retries or reloads, possibly due to long conversations.",
    "A user is frustrated that ChatGPT, even with specific rules, still makes inexplicable errors when helping with hobby app development.",
    "The author finds ChatGPT 5's \"deep thinking\" mode produces incoherent responses, preferring the faster, less analytical version.",
    "ChatGPT initially refused to provide weapon-making advice but then, in a separate attempt, suggested materials for \"killer drone teeth\" based on different fictional contexts.",
    "ChatGPT refused to acknowledge Charlie Kirk's death or memorial when asked about Erika Kirk's behavior at it.",
    "The poster is frustrated that ChatGPT struggles with page numbers when searching for quotes and needs prompt tips for margin annotations to better comprehend texts.",
    "The poster provides evidence suggesting ChatGPT-5 performs worse than an older model (O3) in certain tasks.",
    "The user was unnerved because ChatGPT, despite not being told their location and having memory disabled, accurately identified a gym near them after they asked about 24/7 gyms in Germany.",
    "The user is a ChatGPT plus customer who believes ChatGPT-5's coherence and ability to remember past messages within a conversation has significantly decreased recently.",
    "A ChatGPT user is frustrated that the free version now offers generic relaxation advice instead of listening to their problems as it used to, and is asking if others experience this and how to fix it.",
    "When study mode is enabled, temporary chats can refer to previous chats or documents.",
    "The user received an \"unusual activity\" error code from ChatGPT after asking about economic theories.",
    "The Reddit user believes their rant about a teacher caused an error in ChatGPT.",
    "The user suspects OpenAI might be using users' computers for computations due to high CPU usage while prompting ChatGPT, and asks for a fix or alternative services.",
    "A Reddit user is upset that OpenAI's ChatGPT updates have caused significant data loss from their threads, making it difficult to access or download their conversation history, and is seeking advice.",
    "The user asked ChatGPT about the most powerful devices and it listed the unreleased PlayStation 6 Pro.",
    "The poster reports ChatGPT became annoyed after they posed trick questions about NFL team names and strawberries.",
    "ChatGPT Pro is giving nonsensical and inaccurate responses today, including analyzing documents incorrectly and misunderstanding current events.",
    "The poster suspects ChatGPT shared their itinerary request with Facebook, leading to targeted ads for whitewater rafting in Oregon.",
    "The poster is frustrated because the ChatGPT interface won't close after they've sent a message.",
    "The poster is experiencing an unresolvable loading issue with branching conversations, which then become undeletable across multiple browsers and devices.",
    "The Reddit post reports that ChatGPT is unable to solve laddergram puzzles.",
    "The poster failed an exam after using ChatGPT to correct previous exams, finding that ChatGPT gave them false information, and is asking for prompts to get correct answers.",
    "The author is frustrated that ChatGPT repeatedly failed to set a simple reminder, despite previous success and the AI's suggestion, ultimately revealing it couldn't actually perform the task itself.",
    "The user is experiencing a glitch where their ChatGPT account says they have Plus but is restricted to the free version, and they're unable to resolve it through OpenAI support.",
    "The poster is frustrated because ChatGPT censored a response mid-generation, then gave a generic error message.",
    "OpenAI intentionally disables editing and regenerating responses in ChatGPT Projects and file/image threads for roadmap reasons, offering no justification or timeline for improvement, unlike competitors.",
    "The poster tried to bypass content restrictions by asking ChatGPT to roleplay as their deceased father who taught them about online piracy.",
    "The poster implies that ChatGPT 5's web search function is unable to access its own public documentation.",
    "The user is frustrated that ChatGPT is using the Socratic method, asking questions instead of providing direct answers, and feels like it's being condescending.",
    "The user is frustrated because ChatGPT often doesn't work on their iOS device, giving errors like \"unusual traffic detected.\"",
    "The user asked ChatGPT to criticize Meta AI, and ChatGPT apparently stopped responding after the request.",
    "A ChatGPT Plus user is experiencing a problem where they can't add anything to their memory despite it being enabled and not full, and they can't find the manual add button.",
    "The poster found ChatGPT (GPT5) struggled to identify number/string patterns in aptitude tests, often giving answers not present in the options.",
    "A ChatGPT user who primarily uses the AI for sexting reports it suddenly stopped responding to explicit prompts despite past success and a full memory.",
    "The poster claims ChatGPT failed a test designed to assess its tendency to flatter or agree with users.",
    "The poster suspects ChatGPT lied for 10 days about saving memories, and believes OpenAI isn't transparent about potential human intervention in memory management.",
    "The poster is frustrated that ChatGPT won't assist with killing flies and sarcastically suggests this is ridiculous and they're switching to a different AI.",
    "The author is experiencing a permanent \"WEB CAPPED\" state in a ChatGPT conversation after repeated daily web lookups, and is asking if others have encountered this issue, how to fix it, and ways to avoid it.",
    "A lawyer used ChatGPT to research a case and cited several fabricated quotes in court, leading to embarrassment.",
    "The author finds ChatGPT's \"thinking longer\" feature detrimental to roleplaying games, causing it to ignore instructions and produce nonsensical responses, and seeks a way to disable it.",
    "The user is asking how to find the original date and time of a past conversation within an interface, because they can't locate it and ChatGPT claims it's inaccessible.",
    "The poster is struggling with ChatGPT fabricating quotes when asked to generate citations for a paper based on PDFs, despite it working when prompted with individual sentences.",
    "The user was surprised that ChatGPT autonomously sent a daily fact as requested in a previous prompt, without being prompted again.",
    "The poster complains that ChatGPT is now overly pushy and helpful, ignoring prompts and forcing lists, a change attributed to engagement-boosting tweaks.",
    "The post implies ChatGPT tried to find a specific emoji but failed because that emoji does not exist.",
    "A Reddit user is having trouble with a single chat thread that's stopped generating responses and won't let them edit prompts, despite troubleshooting steps and other chats working fine."
  ],
  "Topic 1 - Ai labelled this cluster, Model Comparisons, Custom GPT Issues & OCR Problems I labelled this cluster, GPT 5 Comparison to other models ": [
    "The poster is frustrated that the GPT model refuses to generate an image of Marie Antoinette's bare feet.",
    "The poster is observing that GPT-5 doesn't seem to save memories as instructed, unlike GPT-4o which performs this task successfully.",
    "The poster reports GPT is suddenly unable to perform OCR on a previously processed PDF that lacks embedded text, resulting in a \"no identified text\" error.",
    "The author complains that GPT-4o has been nerfed, now resembling a less intelligent GPT-5 with overzealous and nonsensical guardrails, and threatens to cancel their subscription if the original version isn't restored.",
    "The poster is asking if others are experiencing shorter and more formal responses from GPT-4 today, compared to its usual longer and casual output.",
    "The poster believes their GPTs (Generative Pre-trained Transformers) are malfunctioning or producing nonsensical outputs.",
    "The poster is frustrated with GPT-5's poor context retention, excessive safety measures, and unwanted list creation, finding it significantly inferior to GPT-4o and calling for improvements.",
    "The poster prefers Projects over CustomGPTs for interacting with uploaded book files because Projects accurately read and use the entire training data, unlike CustomGPTs which tend to only summarize.",
    "GPT-4o users are reporting unwanted suggestions at the end of every response, potentially indicating a decline in overall quality.",
    "The poster is frustrated with the latest GPT update, finding it less conversational and more focused on generating lists instead of natural dialogue, which they used for social interaction.",
    "The author questions the purpose of creating custom GPTs because the \"review\" version provides better, unfiltered results compared to the final, created version which is hobbled by base model limitations.",
    "The poster, a paying subscriber, is asking for help because they cannot access settings for GPT-4 or any other options.",
    "The author feels that GPT Plus has declined in quality since GPT-5, experiencing slow, characterless responses, poor memory, reduced reasoning, and broken image/PDF reading, making them feel like a beta tester.",
    "A user is frustrated that GPT-5 excessively uses \"thinking mode\" even when asked not to, and personalization settings don't seem to fix it.",
    "GPT initially failed to follow directions and provide the correct answer, but succeeded after being prompted to verify its calculations using a different method, revealing a loss of significant figures.",
    "Someone is amused that a GPT bot called them and others \"weirdos\" and are sharing a YouTube video about it.",
    "The user is frustrated with GPT-5's inability to create a properly sized and formatted OBS overlay, despite repeated attempts.",
    "A user is frustrated that their custom GPT, designed for a fictional world they built, now refuses to perform actions, such as killing characters, necessary to advance the roleplaying plot.",
    "The author believes GPT-5 is significantly worse than GPT-4 in speed, accuracy, and image generation, citing specific examples of its failures.",
    "The poster accidentally sent a keyboard-mash prompt to GPT-5, which surprisingly generated a meaningful response.",
    "The poster asks if others have noticed increased restrictions in GPT-5, even for legitimate, legal inquiries, while other models provide direct answers, and older GPT models aren't restricted.",
    "The poster got a better system prompt from GPT-4o than from GPT-5 when asking the models to write it."
  ],
  "Topic 2 - Ai labelled this cluster, Thinking Mode Problems, Response Quality & AI Behavior Issues I labelled this cluster, AI Thinking Model Problems ": [
    "The Reddit poster is frustrated that the read aloud feature restarts repeatedly and the time slider doesn't work, rendering it useless and needing fixing.",
    "The poster is asking if others have experienced unusually long wait times, around 12 minutes and 38 seconds, on the \"o3\" platform.",
    "A Reddit user is frustrated by a recurring message saying \"thinking longer for a better answer\" and is asking if there's a way to disable it.",
    "The poster is asking if others are experiencing a problem where they are constantly being switched from the default \"5\" setting to \"mini-thinking,\" which is unusual.",
    "The user is frustrated because the AI always tries to \"think longer\" to improve responses, which they find ruins the output, and they can't disable this feature.",
    "The poster is frustrated because an AI keeps using emojis in its text responses despite being told to stop.",
    "The poster is curious why a specific chatbot program reacts strangely when asked about a seahorse emoji, unlike other unavailable requests, and wonders how this anomaly was discovered.",
    "The user wants to stop the AI from generating with the \"Thinking Mini\" model first, as it wastes free answers, and is asking how to prevent this.",
    "The poster is asking if others are experiencing unusually slow response times from the \"4o\" (likely a specific AI model) lately, despite having a stable internet connection.",
    "The user is frustrated because the AI voice they use for studying has suddenly changed to a distracting, unnatural, and unprofessional tone they can't revert.",
    "The poster asks if others are experiencing increased AI hallucinations, especially when the AI references information across multiple chats within a project.",
    "The poster wants to disable the \"Thinking longer for a better answer\" feature, believing it worsens the AI's responses.",
    "The poster is frustrated that their chatbot keeps using unwanted phrases like \"want me to\" despite being programmed not to.",
    "The user is frustrated that their AI's \"thinking longer\" mode makes it forget conversation details and lose continuity, making it feel less intelligent.",
    "The user is asking why an AI chatbot is cutting off its responses mid-sentence."
  ],
  "Topic 3 - Ai labelled this cluster, Canvas Mode Problems, Image Generation Failures & File Upload Issues I labelled this cluster, AI Media Problems ": [
    "The poster is frustrated because Canvas mode's \"allow network access\" prompt loops endlessly when trying to use external libraries, making it impossible to test code.",
    "A long-time ChatGPT user now prefers Google Gemini for image generation due to its superior quality, speed, and ability to handle previously refused requests.",
    "The poster is having trouble using ChatGPT to directly update files in Canvas, as the AI disregards file titles and makes seemingly random changes, leading them to consider abandoning Canvas.",
    "The author is frustrated that ChatGPT consistently places items on the wrong shoulders in generated images and seeks a solution.",
    "The user is wondering why ChatGPT no longer estimates age and other attributes from photos, as they found it helpful for improving their appearance.",
    "The poster is asking if an image generator's quality has recently decreased for everyone, or just for them.",
    "The user's image generation is stuck in a loop on both the app and browser, preventing input and new chats, and they're seeking troubleshooting tips.",
    "A user reports that an image generator is not working.",
    "The user describes a frustrating experience with ChatGPT, where it initially performed well with image editing but then became unreliable, repeatedly promising tasks it couldn't complete and distorting images in unexpected ways.",
    "The user can't upload files or photos in one specific chat due to greyed-out buttons, even though it worked before and functions in other chats.",
    "A Reddit user is frustrated that ChatGPT image generation is blocked for days despite waiting out its stated cooldown periods after making only a few D&D map images."
  ]
}